/* REXX */                                                              00010000
                                                                        00020000
width = 25                                                              00030010
height = 6                                                              00040010
                                                                        00050000
input = "123456789012"                                                  00060000
p = ''                                                                  00070007
p=p||'122222222021222212220220022'                                      00071007
p=p||'122202222022012222222222222'                                      00072007
p=p||'022022122222220210000222222'                                      00073007
p=p||'222222112222222222022222222'                                      00074007
p=p||'222222222222222222022022222'                                      00075007
p=p||'222222222222222022222222220'                                      00076007
p=p||'222202120221122222212222122'                                      00077007
p=p||'202222222222222022222222222'                                      00078007
p=p||'222210010222222222222202222'                                      00079007
p=p||'222222022222222222222222222'                                      00079107
p=p||'222222022222222222222222222'                                      00079207
p=p||'222022222222222222212021221'                                      00079307
p=p||'222222212222222002222222222'                                      00079407
p=p||'222022022022222221201000222'                                      00079507
p=p||'222222222202222222222122222'                                      00079607
p=p||'222222222222222222222122222'                                      00079707
p=p||'222222222222222222122222222'                                      00079807
p=p||'122222202022220222022222222'                                      00079907
p=p||'122102222222222222122222222'                                      00080007
p=p||'222220202202222222222222012'                                      00080107
p=p||'222222222222222222222222222'                                      00080207
p=p||'222222222222122222222222222'                                      00080307
p=p||'222222222222222222222222122'                                      00080407
p=p||'222022002212222222002222222'                                      00080507
p=p||'222222122022122222221210200'                                      00080607
p=p||'222222222222122222222222022'                                      00080707
p=p||'222222222222222222222222022'                                      00080807
p=p||'022222222222222221222022222'                                      00080907
p=p||'222222122212121220222122202'                                      00081007
p=p||'222122022222222222222122022'                                      00081107
p=p||'222222221222212222222222222'                                      00081207
p=p||'202222202222022222222222022'                                      00081307
p=p||'222222222222222122222222222'                                      00081407
p=p||'222222222222222222222222222'                                      00081507
p=p||'121222222102222222222212222'                                      00081607
p=p||'222222222222022022221221201'                                      00081707
p=p||'212222222222222122202212222'                                      00081807
p=p||'122222222222022222222222222'                                      00081907
p=p||'122222222222222222222222122'                                      00082007
p=p||'222222222222222122222222222'                                      00082107
p=p||'202222022122222222222222122'                                      00082207
p=p||'222022220220211010222222222'                                      00082307
p=p||'222202212202222122222222222'                                      00082407
p=p||'m22222222222222022022222222'                                      00082530
p=p||'222222220222122222222020222'                                      00082607
p=p||'222020222022102202222122212'                                      00082707
p=p||'222222222222222122022220211'                                      00082807
p=p||'220210222222222222202222212'                                      00082907
p=p||'222122222222222022222222222'                                      00083007
p=p||'222222022222222222222221222'                                      00083107
p=p||'122222222122122212021221122'                                      00083207
p=p||'212212222022002222222222222'                                      00083307
p=p||'222022022222212202020222222'                                      00083407
p=p||'222222122222212202122222222'                                      00083507
p=p||'222122212222222222122222222'                                      00083607
p=p||'222222222222222222222222121'                                      00083707
p=p||'122212020221022112202222022'                                      00083807
p=p||'122222222222222022022122220'                                      00083907
p=p||'202221220222222222222012202'                                      00084007
p=p||'212222222222222222022222222'                                      00084107
p=p||'222222222122222222222222221'                                      00084207
p=p||'222222222222222122202220221'                                      00084307
p=p||'022102222222222012222222222'                                      00084407
p=p||'222222120122222202200210222'                                      00084507
p=p||'222222222222222202212022222'                                      00084607
p=p||'222222122202222222222222222'                                      00084707
p=p||'222022222222220222222222222'                                      00084807
p=p||'220222202020220222122222222'                                      00084907
p=p||'222102222222222222122122022'                                      00085007
p=p||'220210220122222222222220012'                                      00085107
p=p||'212222222222222222222222222'                                      00085207
p=p||'222222222222122222022222222'                                      00085307
p=p||'221222022222222122222222120'                                      00085407
p=p||'221222000202222222222202222'                                      00085507
p=p||'222222222021122221202200011'                                      00085607
p=p||'222222222222002202202212222'                                      00085707
p=p||'222222222122202222222222022'                                      00085807
p=p||'122222022222222220222122222'                                      00085907
p=p||'222022222202020221122201202'                                      00086007
p=p||'222022112212222222222022020'                                      00086107
p=p||'022221201210021222222222220'                                      00086207
p=p||'002202202212022222222222122'                                      00086307
p=p||'202222222222122022222022222'                                      00086407
p=p||'222222222022222222022222202'                                      00086507
p=p||'221221022111202202222122222'                                      00086607
p=p||'222222222122221122221221210'                                      00086707
p=p||'200222222222222002222222212'                                      00086807
p=p||'122222222222022212222222222'                                      00086907
p=p||'122222222222222222220222122'                                      00087007
p=p||'222222020122222122222222102'                                      00087107
p=p||'212212122212202222222222122'                                      00087207
p=p||'020022221201220120222222222'                                      00087307
p=p||'220202222212202222222222222'                                      00087407
p=p||'022212222222222222122222122'                                      00087507
p=p||'222222220222022222222021022'                                      00087607
p=p||'222221221022112202202122202'                                      00087707
p=p||'212222222222122020122220202'                                      00087807
p=p||'221010222222222221122212212'                                      00087907
p=p||'222122222222222222222222222'                                      00088007
p=p||'222122222222222222222221222'                                      00088107
p=p||'122222222221022202222222222'                                      00088207
p=p||'022222212122112222222222222'                                      00088307
p=p||'022022222220210221220222222'                                      00088407
p=p||'202220002222212222122222222'                                      00088507
p=p||'222122222222222222022222222'                                      00088607
p=p||'122222222220222222222222220'                                      00088707
p=p||'222202121220022122222212122'                                      00088807
p=p||'122202222222222122222222221'                                      00088907
p=p||'202201022222222222221222202'                                      00089007
p=p||'222222122222222222222212222'                                      00089107
p=p||'222222122222222022222122222'                                      00089207
p=p||'222222222222221222202121220'                                      00089307
p=p||'022010222202022112222222222'                                      00089407
p=p||'222122021122222211211221222'                                      00089507
p=p||'222202222202222202222122222'                                      00089607
p=p||'222222022222222222222122022'                                      00089707
p=p||'222122222222220222122222222'                                      00089807
p=p||'220220222120221222012222222'                                      00089907
p=p||'222202202222222222222221022'                                      00090007
p=p||'220201211222222222212220012'                                      00090107
p=p||'202222212022222222222222202'                                      00090207
p=p||'222222222022222222122222222'                                      00090307
p=p||'221222022222222222120212022'                                      00090407
p=p||'220022000202222022122212222'                                      00090507
p=p||'222222022022022221222200210'                                      00090607
p=p||'222222212221212202212222222'                                      00090707
p=p||'222222222122212222222222022'                                      00090807
p=p||'122222022222022221222122222'                                      00090907
p=p||'222020022222120221022121112'                                      00091007
p=p||'222122102212222222222222021'                                      00091107
p=p||'022220212202011222222202220'                                      00091207
p=p||'012202202212222222222222222'                                      00091307
p=p||'212022222222022022222222222'                                      00091407
p=p||'022222222022222222220020202'                                      00091507
p=p||'121220022112022202022022222'                                      00091607
p=p||'222222222222221022220210210'                                      00091707
p=p||'110222222222220102202202222'                                      00091807
p=p||'222222222222022212022222222'                                      00091907
p=p||'122022222222222122220220022'                                      00092007
p=p||'222222221021212121220022122'                                      00092107
p=p||'222212222112202222222222122'                                      00092207
p=p||'121222222211200210222222222'                                      00092307
p=p||'221002212212202022222222222'                                      00092407
p=p||'022212222220222222222222122'                                      00092507
p=p||'222022221222022222222122220'                                      00092607
p=p||'212221220222010222122122122'                                      00092707
p=p||'202222222222222121122221212'                                      00092807
p=p||'220100222222222220122202212'                                      00092907
p=p||'212222222222222122222122202'                                      00093007
p=p||'222021222222122222022222221'                                      00093107
p=p||'022222222222021222120222122'                                      00093207
p=p||'112002202122022212222222220'                                      00093307
p=p||'022222222220212202222222222'                                      00093407
p=p||'212220012212212222122222222'                                      00093507
p=p||'222022222122220222022222222'                                      00093607
p=p||'122222222220221222222222120'                                      00093707
p=p||'221212221221222221212022222'                                      00093807
p=p||'212222222222221222220222222'                                      00093907
p=p||'201212100122222202221022202'                                      00094007
p=p||'222202022222222222122222022'                                      00094107
p=p||'220222120022222122222222221'                                      00094207
p=p||'222022220222122220212222220'                                      00094307
p=p||'222211002102222012202222222'                                      00094407
p=p||'221022122122220221202122122'                                      00094507
p=p||'222202222222212212222022222'                                      00094607
p=p||'122222122202122211222020222'                                      00094707
p=p||'222022222022221221222222222'                                      00094807
p=p||'121120222022222222101002122'                                      00094907
p=p||'022222212222222222222120022'                                      00095007
p=p||'220212211112022222222222112'                                      00095107
p=p||'212212212122222022222122222'                                      00095207
p=p||'222210222121022222122222122'                                      00095307
p=p||'222220122220212222121202021'                                      00095407
p=p||'222212202212122222102222222'                                      00095507
p=p||'222220022221122221212220211'                                      00095607
p=p||'122222212221022212202212022'                                      00095707
p=p||'222122222022202022200222020'                                      00095807
p=p||'222222222222122221221122220'                                      00095907
p=p||'222122021222120222012200112'                                      00096007
p=p||'102122212212222222221122022'                                      00096107
p=p||'122221220222121222222222220'                                      00096207
p=p||'222222212202122222222222122'                                      00096307
p=p||'202122211222222122222022222'                                      00096407
p=p||'222221222022220212121220212'                                      00096507
p=p||'020221202220012022222222202'                                      00096607
p=p||'222222221022222022220221202'                                      00096707
p=p||'102222222222222222222222212'                                      00096807
p=p||'122222122222222222002211222'                                      00096907
p=p||'121122222222222222221222222'                                      00097007
p=p||'220222221120212220222122212'                                      00097107
p=p||'202012022022222222222222122'                                      00097207
p=p||'220222220200221101222022202'                                      00097307
p=p||'221122202202202022222022222'                                      00097407
p=p||'222212212201222120022222022'                                      00097507
p=p||'222122222220222221212022021'                                      00097607
p=p||'202221222002001112012122212'                                      00097707
p=p||'202222222222222122122220201'                                      00097807
p=p||'200122122022212221222222202'                                      00097907
p=p||'202222222222222122212222200'                                      00098007
p=p||'222022022222022222022220222'                                      00098107
p=p||'222220212022220202121220212'                                      00098207
p=p||'201202022022112222222222222'                                      00098307
p=p||'122021122222221202220122122'                                      00098407
p=p||'202220112212212222122222222'                                      00098507
p=p||'222022202022222222120122222'                                      00098607
p=p||'022222222221222022222222021'                                      00098707
p=p||'121202221220122201212022122'                                      00098807
p=p||'222222222222220122120022222'                                      00098907
p=p||'221211001122222212222222212'                                      00099007
p=p||'212202122222022222122202012'                                      00099107
p=p||'220222121222222122222122220'                                      00099207
p=p||'221022222202122120202120221'                                      00099307
p=p||'002120202212122022202222222'                                      00099407
p=p||'220122221022221221212222022'                                      00099507
p=p||'022202220002212202212222222'                                      00099607
p=p||'222222222222212200222122122'                                      00099707
p=p||'222022222122221221022221202'                                      00099807
p=p||'022221202022222112000112102'                                      00099907
p=p||'222222202222222222022022222'                                      00100007
p=p||'222210202212222122212220012'                                      00100107
p=p||'222222212222222222222022222'                                      00100207
p=p||'212222222222022222222222022'                                      00100307
p=p||'220220022220212121220212022'                                      00100407
p=p||'221102111222002222112202222'                                      00100507
p=p||'222222222222022220221211012'                                      00100607
p=p||'122222222221002202202222122'                                      00100707
p=p||'222222222022202202221222222'                                      00100807
p=p||'122222222222222221220022222'                                      00100907
p=p||'212021122202222220002011202'                                      00101007
p=p||'022222102222222222220122020'                                      00101107
p=p||'022221200201010222222222222'                                      00101207
p=p||'122202202202022222222222222'                                      00101307
p=p||'222122221222020122222022222'                                      00101407
p=p||'222221202122222212022020202'                                      00101507
p=p||'121222112102112122022212222'                                      00101607
p=p||'222222220022020122222211221'                                      00101707
p=p||'011222222222221012222222222'                                      00101807
p=p||'122222222222222202112212222'                                      00101907
p=p||'022022222022222122222220022'                                      00102007
p=p||'122202220122102022220012012'                                      00102107
p=p||'122112022122222222222221222'                                      00102207
p=p||'022022220220201211221122202'                                      00102307
p=p||'222222212202212122222022222'                                      00102407
p=p||'222222122200222120222222022'                                      00102507
p=p||'222122222200122122202222121'                                      00102607
p=p||'012122221202010212202122122'                                      00102707
p=p||'202222222222222122102222220'                                      00102807
p=p||'202121021022222221112202222'                                      00102907
p=p||'202022222002222122212102210'                                      00103007
p=p||'222121222222022222122221220'                                      00103107
p=p||'222020222122022122120220212'                                      00103207
p=p||'202002022222222202222222222'                                      00103307
p=p||'222120102221222212210020022'                                      00103407
p=p||'222222202202202222222222112'                                      00103507
p=p||'222022202122211222021022222'                                      00103607
p=p||'222222122220220122122212220'                                      00103707
p=p||'220122220221202110122012022'                                      00103807
p=p||'212212222222221222122222220'                                      00103907
p=p||'212202222022122222210022202'                                      00104007
p=p||'212202122222022222022212122'                                      00104107
p=p||'210222022022222122222222222'                                      00104207
p=p||'210022120202020021122121220'                                      00104307
p=p||'222222022002122022212222222'                                      00104407
p=p||'221122122002222222220111220'                                      00104507
p=p||'122212202102222202222122222'                                      00104607
p=p||'012222022202112201202020122'                                      00104707
p=p||'222022222022221221022120202'                                      00104807
p=p||'221120002121221222122002222'                                      00104907
p=p||'122112202222222222022222012'                                      00105007
p=p||'221202210222020122222212202'                                      00105107
p=p||'202222222122222012222122202'                                      00105207
p=p||'012220212222222222022222222'                                      00105307
p=p||'221211222022202220122222121'                                      00105407
p=p||'222002121212202222102212222'                                      00105507
p=p||'222222022121122221211201100'                                      00105607
p=p||'221122222211212222212212122'                                      00105707
p=p||'222122222122222222201202020'                                      00105807
p=p||'122222122222022220220022222'                                      00105907
p=p||'202122220102121222122210202'                                      00106007
p=p||'212122202202222222222122220'                                      00106107
p=p||'002222210211100020122212200'                                      00106207
p=p||'212212222202022222122222222'                                      00106307
p=p||'212102200222021022222222222'                                      00106407
p=p||'022221211022220222022000022'                                      00106507
p=p||'022222112102102022022122212'                                      00106607
p=p||'222222222022222222220201211'                                      00106707
p=p||'222020222222222112202222202'                                      00106807
p=p||'122222122222222202022211202'                                      00106907
p=p||'022222222022222122221210222'                                      00107007
p=p||'121202022001212222220102222'                                      00107107
p=p||'222212122102212222222221222'                                      00107207
p=p||'120202222200200120021122212'                                      00107307
p=p||'222102212202202222222102222'                                      00107407
p=p||'022212022210202220022202022'                                      00107507
p=p||'222122221201220120222022220'                                      00107607
p=p||'202020222102202102102122012'                                      00107707
p=p||'222222222221022221102221200'                                      00107807
p=p||'212100121122222202022212222'                                      00107907
p=p||'212122222002222122222122220'                                      00108007
p=p||'202122222222122222222222221'                                      00108107
p=p||'221022212122012222021222002'                                      00108207
p=p||'120102112222112222222122220'                                      00108307
p=p||'122220022222202211102220222'                                      00108407
p=p||'202221102212222212222222102'                                      00108507
p=p||'221122222112221222021222212'                                      00108607
p=p||'122222022222221121022212222'                                      00108707
p=p||'221022220221102020222002222'                                      00108807
p=p||'122222222122222022020012221'                                      00108907
p=p||'200210110020122212221002212'                                      00109007
p=p||'212212222222202221222202022'                                      00109107
p=p||'212212120122212021222122221'                                      00109207
p=p||'220221120212022022112222221'                                      00109307
p=p||'222112212012122222222222222'                                      00109407
p=p||'222122021202220200212022020'                                      00109507
p=p||'222222212122202222202122222'                                      00109607
p=p||'122221022222002212202120022'                                      00109707
p=p||'202122222122222212120122202'                                      00109807
p=p||'021201022220221102220122002'                                      00109907
p=p||'022010222222122221122221112'                                      00110007
p=p||'221222222020122022202210222'                                      00110107
p=p||'202222212022222002222222212'                                      00110207
p=p||'202211202120222102122222222'                                      00110307
p=p||'221202022020212122011222121'                                      00110407
p=p||'221002011102112222012212222'                                      00110507
p=p||'222222122020012222200212222'                                      00110607
p=p||'020022212222202212202222022'                                      00110707
p=p||'222122220022202202222202120'                                      00110807
p=p||'222012120222122221210022020'                                      00110907
p=p||'222120211012022222002001212'                                      00111007
p=p||'102022102202222122222022121'                                      00111107
p=p||'122221210210121022222202222'                                      00111207
p=p||'102202202202222222200220122'                                      00111307
p=p||'202122200212021021122021222'                                      00111407
p=p||'222220200221221202221001212'                                      00111507
p=p||'020222112110002122222120222'                                      00111607
p=p||'222222222022222212221222220'                                      00111707
p=p||'201121022222202202222202222'                                      00111807
p=p||'220222122221122212202201202'                                      00111907
p=p||'220021002222222122221201122'                                      00112007
p=p||'200222222220122022221222102'                                      00112107
p=p||'202212022212212222002221222'                                      00112207
p=p||'221122222200202012022102212'                                      00112307
p=p||'200012202222212221222201221'                                      00112407
p=p||'122222012221212022121002121'                                      00112507
p=p||'222222220221121020212021110'                                      00112607
p=p||'202121222022222102222022220'                                      00112707
p=p||'212220002221222221202221222'                                      00112807
p=p||'221112121112202012222212202'                                      00112907
p=p||'202122222222222022212202220'                                      00113007
p=p||'202022122112020222122221221'                                      00113107
p=p||'021111212122211112221221002'                                      00113207
p=p||'021122222122210212220022221'                                      00113307
p=p||'122121102222211222121020122'                                      00113407
p=p||'202212112222212222022222012'                                      00113507
p=p||'221022222200201212020122022'                                      00113607
p=p||'221222122221220122202202021'                                      00113707
p=p||'201112121221112200012112022'                                      00113807
p=p||'111222122012221122120012221'                                      00113907
p=p||'222222110120122212111222202'                                      00114007
p=p||'212202120222211221122202020'                                      00114107
p=p||'212222221021122020222222220'                                      00114207
p=p||'200020112212121121002220221'                                      00114307
p=p||'102122022212222201202220122'                                      00114407
p=p||'220122221222222201222222221'                                      00114507
p=p||'022212002122212222202021222'                                      00114607
p=p||'112221022222001200202120221'                                      00114707
p=p||'112021222122221211122222202'                                      00114807
p=p||'122010122020222122211002212'                                      00114907
p=p||'022102202122112222222120022'                                      00115007
p=p||'220221211120221202212200102'                                      00115107
p=p||'222212202220222200220122202'                                      00115207
p=p||'112210222122120102020222022'                                      00115307
p=p||'220222221002222121011202120'                                      00115407
p=p||'221022220222022122200212222'                                      00115507
p=p||'002222122221212221222211101'                                      00115607
p=p||'021012222201012222212202022'                                      00115707
p=p||'222122220222202100220222222'                                      00115807
p=p||'122122021222122220202022212'                                      00115907
p=p||'202122000112022220202201222'                                      00116007
p=p||'121122222212220002222122120'                                      00116107
p=p||'110220200211022121122222000'                                      00116207
p=p||'222212212222221222010220222'                                      00116307
p=p||'222120201222022121222122222'                                      00116407
p=p||'022221220221020212020202222'                                      00116507
p=p||'220221212110122210222001212'                                      00116607
p=p||'021212222022122211222210212'                                      00116707
p=p||'010220112212210012222222220'                                      00116807
p=p||'222222121222222212202202222'                                      00116907
p=p||'121220222021222122222212222'                                      00117007
p=p||'102212122111122221220122112'                                      00117107
p=p||'202122022211202022022220122'                                      00117207
p=p||'221112222211220221022112212'                                      00117307
p=p||'000012210222220020222100220'                                      00117407
p=p||'222000212201212121121020021'                                      00117507
p=p||'222222220212121112202202121'                                      00117607
p=p||'222120220112211002002222022'                                      00117707
p=p||'202221222220222222211222112'                                      00117807
p=p||'222010221122212022102201212'                                      00117907
p=p||'221022222101221022222211212'                                      00118007
p=p||'202121221012120222022221220'                                      00118107
p=p||'022012202222122022122210202'                                      00118207
p=p||'011222211022001222202002222'                                      00118307
p=p||'122221222221101201021120002'                                      00118407
p=p||'222212122200202221120222020'                                      00118507
p=p||'222222101021200222220020122'                                      00118607
p=p||'220222122222202122120202101'                                      00118707
p=p||'201022122200112022022201222'                                      00118807
p=p||'111222011122220222221110220'                                      00118907
p=p||'222210001221002202201022200'                                      00119007
p=p||'212210221222020221022122220'                                      00119107
p=p||'200202221121101121222022220'                                      00119207
p=p||'220022001102002002102022222'                                      00119307
p=p||'102101202212022202202221112'                                      00119407
p=p||'220022222020220211201121020'                                      00119507
p=p||'012222202212221202222021222'                                      00119607
p=p||'201220222121201210222020121'                                      00119707
p=p||'021221222122220221120122122'                                      00119807
p=p||'222201102122212122002012112'                                      00119907
p=p||'122012212020222220122220221'                                      00120007
p=p||'221201201222101202212202202'                                      00120107
p=p||'211212222022222112220222202'                                      00120207
p=p||'201212202221022002122222122'                                      00120307
p=p||'221202100011112102200212020'                                      00120407
p=p||'202102102212121022121202000'                                      00120507
p=p||'022221122121012222002220000'                                      00120607
p=p||'002011202001112211222211021'                                      00120707
p=p||'222102222122110101221222020'                                      00120807
p=p||'020102222222022222212120011'                                      00120907
p=p||'002112021122021210222222212'                                      00121007
p=p||'110222121222010122222122022'                                      00121107
p=p||'202220211212020010201222010'                                      00121207
p=p||'112201202222122222020220022'                                      00121307
p=p||'221001210212222021211022222'                                      00121407
p=p||'222222211010002212122222112'                                      00121507
p=p||'121221102110012120022201202'                                      00121607
p=p||'102212221122122212220020212'                                      00121707
p=p||'201001120222011002221022210'                                      00121807
p=p||'121222220221022220021222202'                                      00121907
p=p||'220220112122222022221222010'                                      00122007
p=p||'222202102010102222200212011'                                      00122107
p=p||'122210221212222222002220122'                                      00122207
p=p||'022110222220200212220002222'                                      00122307
p=p||'202022221222202021222022221'                                      00122407
p=p||'122112121221222020021002121'                                      00122507
p=p||'222222222222202110202102112'                                      00122607
p=p||'122020200122000112000122122'                                      00122707
p=p||'212211202220222021212221200'                                      00122807
p=p||'210220221010222222002202212'                                      00122907
p=p||'220121222122222222100020211'                                      00123007
p=p||'221021221211022222222221222'                                      00123107
p=p||'112101002202222212220200122'                                      00123207
p=p||'002122200222100202111222220'                                      00123307
p=p||'222120020222020200121010001'                                      00123407
p=p||'222201112202202200221222212'                                      00123507
p=p||'221022210212212222122222022'                                      00123607
p=p||'121222022222110101021102112'                                      00123707
p=p||'002012022202022202002010020'                                      00123807
p=p||'102202221022220122022201221'                                      00123907
p=p||'210212002011212222122122201'                                      00124007
p=p||'222220221120012222122012220'                                      00124107
p=p||'210202021220010020222022221'                                      00124207
p=p||'110212210202021220202220202'                                      00124307
p=p||'112002122220121221222212012'                                      00124407
p=p||'220222121102221202212101201'                                      00124507
p=p||'102202011112200022222021022'                                      00124607
p=p||'220221122002211221222021021'                                      00124707
p=p||'110021222222220201211120112'                                      00124807
p=p||'002011012122201102021022222'                                      00124907
p=p||'020100212022112221020122212'                                      00125007
p=p||'220021221201102022222121202'                                      00125107
p=p||'220102202020121002222002110'                                      00125207
p=p||'121220221222022122022222222'                                      00125307
p=p||'222121211112222122220002220'                                      00125407
p=p||'212002121202221120022202222'                                      00125507
p=p||'022222022021221221112202212'                                      00125607
p=p||'112111222010212212002201222'                                      00125707
p=p||'220202220102010221102210120'                                      00125807
p=p||'221101222222222221102002012'                                      00125907
p=p||'012120022122120210202222212'                                      00126007
p=p||'022122210222200212222121220'                                      00126107
p=p||'112222220202021201212222201'                                      00126207
p=p||'222211202220221122221221122'                                      00126307
p=p||'212202010222020120120122222'                                      00126407
p=p||'022221100220212102100001002'                                      00126507
p=p||'021212002111112001120212222'                                      00126607
p=p||'122012220122021012221001211'                                      00126707
p=p||'210222221202220212222122202'                                      00126807
p=p||'020022121220002000112102201'                                      00126907
p=p||'220021101120222222221101011'                                      00127007
p=p||'200022121121212020210112201'                                      00127107
p=p||'002012222221212002102120121'                                      00127207
p=p||'020020221000210221011012222'                                      00127307
p=p||'210122222222200022221111221'                                      00127407
p=p||'212020210000222022120212021'                                      00127507
p=p||'222022220202112010202000012'                                      00127607
p=p||'022220212202000202212121001'                                      00127707
p=p||'212212012221220020222220221'                                      00127807
p=p||'202111222010002022112222122'                                      00127907
p=p||'211121020211222222200101111'                                      00128007
p=p||'222020121120022222222220111'                                      00128107
p=p||'001011212020000012220202022'                                      00128207
p=p||'022112011221102002020122221'                                      00128307
p=p||'022122111222100200021011010'                                      00128407
p=p||'222100102212112221221222112'                                      00128507
p=p||'220122111111211200020100221'                                      00128607
p=p||'120222222221001212110112201'                                      00128707
p=p||'002102002222222211022220020'                                      00128807
p=p||'121222122012120011220022221'                                      00128907
p=p||'200201101011211122112102211'                                      00129007
p=p||'222202221122202222002200210'                                      00129107
p=p||'222200021000211122222112220'                                      00129207
p=p||'011000101112000122002102202'                                      00129307
p=p||'022001222102221001102122122'                                      00129407
p=p||'021022020200221112210000202'                                      00129507
p=p||'021122111222202022200021200'                                      00129607
p=p||'001201022002110100212122011'                                      00129707
p=p||'121120222012220010022002122'                                      00129807
p=p||'022210022111210212202002001'                                      00129907
p=p||'102212102121022021111221200'                                      00130007
p=p||'220022201210121010122110222'                                      00130107
p=p||'221212212021010102222102002'                                      00130207
p=p||'220221210122110120120222102'                                      00130307
p=p||'222111122100112202211112021'                                      00130407
p=p||'120012122102212011211122102'                                      00130507
p=p||'022220002220221221120211211'                                      00130607
p=p||'101200212002102220112221222'                                      00130707
p=p||'020220201122011020012221220'                                      00130807
p=p||'101002020222122220100221011'                                      00130907
p=p||'122120000212101002102100122'                                      00131007
p=p||'110000110012200002221021122'                                      00131107
p=p||'022220221201020000211112112'                                      00131207
p=p||'112212222210120000000201102'                                      00131307
p=p||'200210110212221101210022222'                                      00131407
p=p||'202220020112002022021022122'                                      00131507
p=p||'021010222121222120021101222'                                      00131607
p=p||'022202020120221022220112222'                                      00131707
p=p||'201121122122010222222102220'                                      00131807
p=p||'221211200210002211201012202'                                      00131907
p=p||'022112212020122002220220100'                                      00132007
p=p||'112202122002102122010122210'                                      00132107
p=p||'022200100011222101212220211'                                      00132207
p=p||'020111220222222001122120102'                                      00132307
p=p||'221212221222210122012020202'                                      00132407
p=p||'122020101001211120200100120'                                      00132507
p=p||'022202221222011212202220000'                                      00132607
p=p||'202001002002022202022110021'                                      00132707
p=p||'220111202121222122122220201'                                      00132807
p=p||'212200210220112002212212012'                                      00132907
p=p||'210021002200212012111002001'                                      00133007
p=p||'200121202200221022212221022'                                      00133107
p=p||'000111200112220201120010120'                                      00133207
p=p||'220220210222111022200001200'                                      00133307
p=p||'222202210000100020021010101'                                      00133407
p=p||'220200010122011000210212201'                                      00133507
p=p||'122101121221121120101211021'                                      00133607
p=p||'010101201000111'                                                  00133707
                                                                        00133810
input = p                                                               00133910
layers. = ''                                                            00134000
                                                                        00134100
                                                                        00134201
layer = 1                                                               00134303
layerdata = ''                                                          00134403
do p = 1 to length(input)                                               00134501
  if p > layer * width * height then do                                 00134603
    layers.layer = layerdata                                            00134703
    layerdata = substr(input,p,1)                                       00134803
    layer = layer + 1                                                   00134903
  end                                                                   00135003
  else do                                                               00135103
    layerdata = layerdata || substr(input,p,1)                          00135203
  end                                                                   00135303
end                                                                     00135401
layers.layer = layerdata                                                00136004
                                                                        00140003
minzero = 1000000                                                       00141011
minzerolayer = null                                                     00142011
                                                                        00143011
do jj = 1 to layer                                                      00150003
  zeros = count(layers.jj,'0')                                          00161005
  if zeros < minzero then do                                            00161111
    minzero = zeros                                                     00161211
    minzerolayer = jj                                                   00161311
  end                                                                   00161411
end                                                                     00170003
                                                                        00180005
                                                                        00181011
say "Least of zeros in layer "minzerolayer                              00182011
ones = count(layers.minzerolayer,'1')                                   00183011
twos = count(layers.minzerolayer,'2')                                   00184011
say "Anser part one -> " ones * twos                                    00185011
                                                                        00200005
say "printing layer"                                                    00201012
x = printlayer(layers.minzerolayer)                                     00202012
                                                                        00203012
                                                                        00203118
say "addlayer test"                                                     00203231
t1 = "111200"                                                           00203331
t2 = "000100"                                                           00203431
say addLayers(t1,t2)                                                    00203531
                                                                        00203618
r = layers.layer                                                        00203836
b = layer -1                                                            00203933
                                                                        00204027
do while b > 0                                                          00204127
  say "layer " b                                                        00204229
  r = addLayers(layers.b,r)                                             00204332
  b = b - 1                                                             00204427
end                                                                     00204518
x = printlayer(r)                                                       00204625
                                                                        00204718
exit                                                                    00205013
count:                                                                  00210005
  parse arg in,what                                                     00220005
  total = 0                                                             00221005
  do c = 1 to length(in)                                                00230005
    if substr(in,c,1) = what then total = total + 1                     00231005
  end                                                                   00240005
  return total                                                          00250005
                                                                        00260012
printlayer:                                                             00270012
  parse arg l                                                           00280012
  startpos = 1                                                          00281012
  l = translate(l,' ',0)                                                00282039
  do x = 1 to height                                                    00290012
    say substr(l,startpos,width)                                        00310017
    startpos = startpos + width                                         00320014
  end                                                                   00330012
  return 0                                                              00340012
                                                                        00350018
addLayers:                                                              00360018
  /* adds layer2 to layer1 */                                           00361018
  parse arg l1, l2                                                      00370018
  reslayer = ''                                                         00371018
  do i = 1 to length(l1)                                                00380018
                                                                        00380134
    l1c = substr(l1,i,1)                                                00381018
    l2c = substr(l2,i,1)                                                00382018
    if l1c = '2' then r   = l2c                                         00383034
    else r = l1c                                                        00384035
    reslayer = reslayer || r                                            00385034
  end                                                                   00390018
  return reslayer                                                       00400020
