/* REXX */                                                              00010000
theInput = 1                                                            00092199
p = ''                                                                  00092399
p = p || '3, 225, 1, 225, 6, 6, 1100, '                                 00092499
p = p || '1, 238, 225, 104, 0, 1101, 81, '                              00092599
p = p || '30, 225, 1102, 9, 63, 225, 1001, '                            00092699
p = p || '92, 45, 224, 101, -83, 224, 224, '                            00092799
p = p || '4, 224, 102, 8, 223, 223, 101, '                              00092899
p = p || '2, 224, 224, 1, 224, 223, 223, '                              00092999
p = p || '1102, 41, 38, 225, 1002, 165, 73, '                           00093099
p = p || '224, 101, -2920, 224, 224, 4, 224, '                          00093199
p = p || '102, 8, 223, 223, 101, 4, 224, '                              00094099
p = p || '224, 1, 223, 224, 223, 1101, 18, '                            00095099
p = p || '14, 224, 1001, 224, -32, 224, 4, '                            00096099
p = p || '224, 1002, 223, 8, 223, 101, 3, '                             00097099
p = p || '224, 224, 1, 224, 223, 223, 1101, '                           00098099
p = p || '67, 38, 225, 1102, 54, 62, 224, '                             00099099
p = p || '1001, 224, -3348, 224, 4, 224, 1002, '                        00100099
p = p || '223, 8, 223, 1001, 224, 1, 224, '                             00101099
p = p || '1, 224, 223, 223, 1, 161, 169, '                              00102099
p = p || '224, 101, -62, 224, 224, 4, 224, '                            00103099
p = p || '1002, 223, 8, 223, 101, 1, 224, '                             00104099
p = p || '224, 1, 223, 224, 223, 2, 14, '                               00105099
p = p || '18, 224, 1001, 224, -1890, 224, 4, '                          00105199
p = p || '224, 1002, 223, 8, 223, 101, 3, '                             00105299
p = p || '224, 224, 1, 223, 224, 223, 1101, '                           00105399
p = p || '20, 25, 225, 1102, 40, 11, 225, '                             00105499
p = p || '1102, 42, 58, 225, 101, 76, 217, '                            00105599
p = p || '224, 101, -153, 224, 224, 4, 224, '                           00105699
p = p || '102, 8, 223, 223, 1001, 224, 5, '                             00105799
p = p || '224, 1, 224, 223, 223, 102, 11, '                             00105899
p = p || '43, 224, 1001, 224, -451, 224, 4, '                           00105999
p = p || '224, 1002, 223, 8, 223, 101, 6, '                             00106099
p = p || '224, 224, 1, 223, 224, 223, 1102, '                           00106199
p = p || '77, 23, 225, 4, 223, 99, 0, '                                 00106299
p = p || '0, 0, 677, 0, 0, 0, 0, '                                      00106399
p = p || '0, 0, 0, 0, 0, 0, 0, '                                        00106499
p = p || '1105, 0, 99999, 1105, 227, 247, 1105, '                       00106599
p = p || '1, 99999, 1005, 227, 99999, 1005, 0, '                        00106699
p = p || '256, 1105, 1, 99999, 1106, 227, 99999, '                      00106799
p = p || '1106, 0, 265, 1105, 1, 99999, 1006, '                         00106899
p = p || '0, 99999, 1006, 227, 274, 1105, 1, '                          00106999
p = p || '99999, 1105, 1, 280, 1105, 1, 99999, '                        00107099
p = p || '1, 225, 225, 225, 1101, 294, 0, '                             00107199
p = p || '0, 105, 1, 0, 1105, 1, 99999, '                               00107299
p = p || '1106, 0, 300, 1105, 1, 99999, 1, '                            00107399
p = p || '225, 225, 225, 1101, 314, 0, 0, '                             00107499
p = p || '106, 0, 0, 1105, 1, 99999, 8, '                               00107599
p = p || '226, 677, 224, 1002, 223, 2, 223, '                           00107699
p = p || '1006, 224, 329, 1001, 223, 1, 223, '                          00107799
p = p || '7, 226, 226, 224, 102, 2, 223, '                              00107899
p = p || '223, 1006, 224, 344, 101, 1, 223, '                           00107999
p = p || '223, 108, 677, 677, 224, 1002, 223, '                         00108099
p = p || '2, 223, 1006, 224, 359, 101, 1, '                             00108199
p = p || '223, 223, 1107, 226, 677, 224, 1002, '                        00108299
p = p || '223, 2, 223, 1005, 224, 374, 101, '                           00108399
p = p || '1, 223, 223, 1008, 677, 226, 224, '                           00108499
p = p || '1002, 223, 2, 223, 1005, 224, 389, '                          00108599
p = p || '101, 1, 223, 223, 1007, 677, 226, '                           00108699
p = p || '224, 1002, 223, 2, 223, 1005, 224, '                          00108799
p = p || '404, 1001, 223, 1, 223, 1107, 677, '                          00108899
p = p || '226, 224, 1002, 223, 2, 223, 1005, '                          00108999
p = p || '224, 419, 1001, 223, 1, 223, 108, '                           00109099
p = p || '677, 226, 224, 102, 2, 223, 223, '                            00109199
p = p || '1006, 224, 434, 1001, 223, 1, 223, '                          00109299
p = p || '7, 226, 677, 224, 102, 2, 223, '                              00109399
p = p || '223, 1005, 224, 449, 1001, 223, 1, '                          00109499
p = p || '223, 107, 226, 226, 224, 102, 2, '                            00109599
p = p || '223, 223, 1006, 224, 464, 101, 1, '                           00109699
p = p || '223, 223, 107, 677, 226, 224, 102, '                          00109799
p = p || '2, 223, 223, 1006, 224, 479, 101, '                           00109899
p = p || '1, 223, 223, 1007, 677, 677, 224, '                           00109999
p = p || '1002, 223, 2, 223, 1006, 224, 494, '                          00110099
p = p || '1001, 223, 1, 223, 1008, 226, 226, '                          00110199
p = p || '224, 1002, 223, 2, 223, 1006, 224, '                          00110299
p = p || '509, 101, 1, 223, 223, 7, 677, '                              00110399
p = p || '226, 224, 1002, 223, 2, 223, 1006, '                          00110499
p = p || '224, 524, 1001, 223, 1, 223, 1007, '                          00110599
p = p || '226, 226, 224, 102, 2, 223, 223, '                            00110699
p = p || '1006, 224, 539, 101, 1, 223, 223, '                           00110799
p = p || '8, 677, 226, 224, 1002, 223, 2, '                             00110899
p = p || '223, 1006, 224, 554, 101, 1, 223, '                           00110999
p = p || '223, 1008, 677, 677, 224, 102, 2, '                           00111099
p = p || '223, 223, 1006, 224, 569, 101, 1, '                           00111199
p = p || '223, 223, 1108, 677, 226, 224, 102, '                         00111299
p = p || '2, 223, 223, 1005, 224, 584, 101, '                           00111399
p = p || '1, 223, 223, 107, 677, 677, 224, '                            00111499
p = p || '102, 2, 223, 223, 1006, 224, 599, '                           00111599
p = p || '1001, 223, 1, 223, 1108, 677, 677, '                          00111699
p = p || '224, 1002, 223, 2, 223, 1006, 224, '                          00111799
p = p || '614, 1001, 223, 1, 223, 1107, 677, '                          00111899
p = p || '677, 224, 1002, 223, 2, 223, 1005, '                          00111999
p = p || '224, 629, 1001, 223, 1, 223, 108, '                           00112099
p = p || '226, 226, 224, 1002, 223, 2, 223, '                           00112199
p = p || '1005, 224, 644, 101, 1, 223, 223, '                           00112299
p = p || '8, 226, 226, 224, 1002, 223, 2, '                             00112399
p = p || '223, 1005, 224, 659, 101, 1, 223, '                           00112499
p = p || '223, 1108, 226, 677, 224, 1002, 223, '                        00112599
p = p || '2, 223, 1006, 224, 674, 101, 1, '                             00112699
p = p || '223, 223, 4, 223, 99, 226'                                    00112799
                                                                        00112899
r = run2(p)                                                             00112999
say r                                                                   00113099
exit                                                                    00113199
                                                                        00113299
run2:                                                                   00113399
  parse arg prog                                                        00113499
  prog = translate(prog, ' ', ',')             /* get rid of commas  */ 00113599
  instructions = words(prog)                   /* count them all     */ 00113699
  p. = ''                                      /* stick em in a stem */ 00113799
  do i = 0 to instructions                                              00113899
    p.i= word(prog, i+1)                                                00113999
  end                                                                   00114099
  say    "Total Instructions "instructions                              00114199
  next = 0                                     /* point to next inst */ 00114299
  cont = 1                                     /* no halt psw :)     */ 00114399
  do while cont = 1                                                     00114499
    inst = right(p.next,'5',0)                 /* get the full inst  */ 00115099
    opcode = substr(inst,4,2)                  /* get the opcode     */ 00115399
    mod1   = substr(inst,3,1)                  /* mode 1st parm      */ 00115499
    mod2   = substr(inst,2,1)                  /* mode 2nd parm      */ 00115599
    mod3   = substr(inst,1,1)                  /* mode 3rd parm      */ 00115699
    select                                                              00116199
      when opcode = '01' then do               /* Addition           */ 00116299
        p1 =   next + 1                                                 00116399
        p2 =   next + 2                                                 00116499
        p3 =   next + 3                                                 00116599
        parm1 = p.p1                                                    00116699
        parm2 = p.p2                                                    00116799
        parm3 = p.p3                                                    00116899
        next = next + 4                                                 00117599
        if mod1 = 0 then parm1 = p.parm1                                00117699
        if mod2 = 0 then parm2 = p.parm2                                00118099
                                                                        00118499
                                                                        00118599
        p.parm3 = parm1 + parm2                                         00118899
        iterate                                                         00118999
      end                                                               00119099
      when opcode = '02' then do               /* Multiplication     */ 00119199
        p1 =   next + 1                                                 00119299
        p2 =   next + 2                                                 00119399
        p3 =   next + 3                                                 00119499
        parm1 = p.p1                                                    00119599
        parm2 = p.p2                                                    00119699
        parm3 = p.p3                                                    00119799
        next = next + 4                                                 00120499
        if mod1 = 0 then parm1 = p.parm1                                00120599
        if mod2 = 0 then parm2 = p.parm2                                00120699
                                                                        00121299
        p.parm3 = parm1 * parm2                                         00121599
        iterate                                                         00121699
      end                                                               00121799
      when opcode = '03' then do               /* Store              */ 00121899
        p1 =   next + 1                                                 00121999
        parm1 = p.p1                                                    00122099
        next = next + 2                                                 00122499
                                                                        00123399
        p.parm1 = theInput                                              00123799
        iterate                                                         00123899
      end                                                               00123999
      when opcode = '04' then do               /* Output             */ 00125799
        p1 = next + 1                                                   00125899
        parm1 = p.p1                                                    00125999
        if mod1 = 0 then parm1 = p.parm1                                00126399
        say "Output: " parm1                                            00126599
        next = next + 2                                                 00127299
        iterate                                                         00127399
      end                                                               00127499
      when opcode = '99' then do               /* Terminate          */ 00127599
        say "Program terminated"                                        00127699
        cont = 0                                                        00127799
      end                                                               00127899
      otherwise do                                                      00127999
        say "unexpected opcode"                                         00128099
      end                                                               00128199
    end                                                                 00128299
    if next > instructions then cont = 0                                00128399
  end                                                                   00128499
  res = p.0                                                             00128599
  do jj = 1 to instructions                                             00128699
    res = res || ',' || p.jj                                            00128799
  end                                                                   00128899
  return res                                                            00128999
                                                                        00129099
