/* REXX */                                                              00010000
                                                                        00020000
p = ''                                                                  00046241
p = p || '3, 8, 1001, 8, 10, 8, 105, '                                  00046341
p = p || '1, 0, 0, 21, 38, 47, 72, '                                    00046441
p = p || '97, 122, 203, 284, 365, 446, 99999, '                         00046541
p = p || '3, 9, 1001, 9, 3, 9, 1002, '                                  00046641
p = p || '9, 5, 9, 1001, 9, 4, 9, '                                     00046741
p = p || '4, 9, 99, 3, 9, 102, 3, '                                     00046841
p = p || '9, 9, 4, 9, 99, 3, 9, '                                       00046941
p = p || '1001, 9, 2, 9, 102, 5, 9, '                                   00047041
p = p || '9, 101, 3, 9, 9, 1002, 9, '                                   00047141
p = p || '5, 9, 101, 4, 9, 9, 4, '                                      00047241
p = p || '9, 99, 3, 9, 101, 5, 9, '                                     00047341
p = p || '9, 1002, 9, 3, 9, 101, 2, '                                   00047441
p = p || '9, 9, 102, 3, 9, 9, 1001, '                                   00047541
p = p || '9, 2, 9, 4, 9, 99, 3, '                                       00047641
p = p || '9, 101, 3, 9, 9, 102, 2, '                                    00047741
p = p || '9, 9, 1001, 9, 4, 9, 1002, '                                  00047841
p = p || '9, 2, 9, 101, 2, 9, 9, '                                      00047941
p = p || '4, 9, 99, 3, 9, 1001, 9, '                                    00048041
p = p || '2, 9, 4, 9, 3, 9, 101, '                                      00048141
p = p || '2, 9, 9, 4, 9, 3, 9, '                                        00048241
p = p || '102, 2, 9, 9, 4, 9, 3, '                                      00048341
p = p || '9, 1001, 9, 1, 9, 4, 9, '                                     00048441
p = p || '3, 9, 102, 2, 9, 9, 4, '                                      00048541
p = p || '9, 3, 9, 101, 2, 9, 9, '                                      00048641
p = p || '4, 9, 3, 9, 1001, 9, 1, '                                     00048741
p = p || '9, 4, 9, 3, 9, 101, 2, '                                      00048841
p = p || '9, 9, 4, 9, 3, 9, 101, '                                      00048941
p = p || '1, 9, 9, 4, 9, 3, 9, '                                        00049041
p = p || '1001, 9, 2, 9, 4, 9, 99, '                                    00049141
p = p || '3, 9, 1001, 9, 1, 9, 4, '                                     00049241
p = p || '9, 3, 9, 101, 1, 9, 9, '                                      00049341
p = p || '4, 9, 3, 9, 101, 2, 9, '                                      00049441
p = p || '9, 4, 9, 3, 9, 102, 2, '                                      00049541
p = p || '9, 9, 4, 9, 3, 9, 101, '                                      00049641
p = p || '2, 9, 9, 4, 9, 3, 9, '                                        00049741
p = p || '101, 1, 9, 9, 4, 9, 3, '                                      00049841
p = p || '9, 1002, 9, 2, 9, 4, 9, '                                     00049941
p = p || '3, 9, 101, 1, 9, 9, 4, '                                      00050041
p = p || '9, 3, 9, 102, 2, 9, 9, '                                      00050141
p = p || '4, 9, 3, 9, 102, 2, 9, '                                      00050241
p = p || '9, 4, 9, 99, 3, 9, 1001, '                                    00050341
p = p || '9, 2, 9, 4, 9, 3, 9, '                                        00050441
p = p || '1002, 9, 2, 9, 4, 9, 3, '                                     00050541
p = p || '9, 1001, 9, 2, 9, 4, 9, '                                     00050641
p = p || '3, 9, 102, 2, 9, 9, 4, '                                      00050741
p = p || '9, 3, 9, 102, 2, 9, 9, '                                      00050841
p = p || '4, 9, 3, 9, 101, 2, 9, '                                      00050941
p = p || '9, 4, 9, 3, 9, 1001, 9, '                                     00051041
p = p || '1, 9, 4, 9, 3, 9, 101, '                                      00051141
p = p || '1, 9, 9, 4, 9, 3, 9, '                                        00051241
p = p || '1002, 9, 2, 9, 4, 9, 3, '                                     00051341
p = p || '9, 102, 2, 9, 9, 4, 9, '                                      00051441
p = p || '99, 3, 9, 101, 1, 9, 9, '                                     00051541
p = p || '4, 9, 3, 9, 101, 1, 9, '                                      00051641
p = p || '9, 4, 9, 3, 9, 102, 2, '                                      00051741
p = p || '9, 9, 4, 9, 3, 9, 102, '                                      00051841
p = p || '2, 9, 9, 4, 9, 3, 9, '                                        00051941
p = p || '101, 2, 9, 9, 4, 9, 3, '                                      00052041
p = p || '9, 101, 2, 9, 9, 4, 9, '                                      00052141
p = p || '3, 9, 1001, 9, 2, 9, 4, '                                     00052241
p = p || '9, 3, 9, 1001, 9, 2, 9, '                                     00052341
p = p || '4, 9, 3, 9, 102, 2, 9, '                                      00052441
p = p || '9, 4, 9, 3, 9, 1001, 9, '                                     00052541
p = p || '1, 9, 4, 9, 99, 3, 9, '                                       00052641
p = p || '101, 2, 9, 9, 4, 9, 3, '                                      00052741
p = p || '9, 101, 2, 9, 9, 4, 9, '                                      00052841
p = p || '3, 9, 1001, 9, 2, 9, 4, '                                     00052941
p = p || '9, 3, 9, 102, 2, 9, 9, '                                      00053041
p = p || '4, 9, 3, 9, 102, 2, 9, '                                      00053141
p = p || '9, 4, 9, 3, 9, 101, 1, '                                      00053241
p = p || '9, 9, 4, 9, 3, 9, 1002, '                                     00053341
p = p || '9, 2, 9, 4, 9, 3, 9, '                                        00053441
p = p || '1002, 9, 2, 9, 4, 9, 3, '                                     00053541
p = p || '9, 101, 2, 9, 9, 4, 9, '                                      00053641
p = p || '3, 9, 1001, 9, 2, 9, 4, '                                     00053741
p = p || '9, 99'                                                        00053841
                                                                        00053941
                                                                        00054000
tv.0 = 5                                                                00055007
tv.1 = 0                                                                00060007
tv.2 = 1                                                                00070007
tv.3 = 2                                                                00080007
tv.4 = 3                                                                00090007
tv.5 = 4                                                                00100007
                                                                        00110007
maxPower = 0                                                            00110122
powers=""                                                               00110240
do a = 1 to tv.0                                                        00111007
  do b = 1 to tv.0                                                      00112012
    if b /= a then do                                                   00112112
      do c = 1 to tv.0                                                  00112212
        if c /= a & c /=b then do                                       00112312
          do d = 1 to tv.0                                              00112412
            if d /= a & d /= b & c /= d then do                         00112512
              do e = 1 to tv.0                                          00112612
                if e /= a & e /= b & e /= c & e /= d then do            00112712
                  theInput = tv.a                                       00113232
                  input2 = 0                                            00113323
                  pa = run2(p)                                          00113518
                  theInput = tv.b                                       00113632
                  input2 = pa                                           00113723
                  pb = run2(p)                                          00113918
                  theInput = tv.c                                       00114032
                  input2 = pb                                           00114123
                  pc = run2(p)                                          00114318
                  theInput = tv.d                                       00114432
                  input2 = pc                                           00114523
                  pd = run2(p)                                          00114718
                  theInput = tv.e                                       00114832
                  input2 = pd                                           00114923
                  pe = run2(p)                                          00115118
                  totalPower = pe                                       00115227
                  powers = powers","pe                                  00115340
                  if totalPower > maxPower then do                      00115422
                    maxPower = totalPower                               00115522
                    maxConfig = tv.a tv.b tv.c tv.d tv.e                00115624
                  end                                                   00115722
                end                                                     00115817
              end                                                       00115917
            end                                                         00116017
          end                                                           00116117
        end                                                             00116217
      end                                                               00116317
    end                                                                 00116417
  end                                                                   00116517
end                                                                     00116617
say powers                                                              00116740
say maxPower                                                            00116822
say maxConfig                                                           00116922
                                                                        00117017
exit                                                                    00117117
                                                                        00117217
run2:                                                                   00117317
  parse arg prog                                                        00117417
  res = "NO OUTPUT"                                                     00117517
  prog = translate(prog, ' ', ',')             /* get rid of commas  */ 00117617
  instructions = words(prog)                   /* count them all     */ 00117717
  p. = ''                                      /* stick em in a stem */ 00117817
  do i = 0 to instructions                                              00117917
    p.i= word(prog, i+1)                                                00118017
  end                                                                   00118117
  next = 0                                     /* point to next inst */ 00118217
  cont = 1                                     /* no halt psw :)     */ 00118317
  do while cont = 1                                                     00118417
    inst = right(p.next,'5',0)                 /* get the full inst  */ 00118517
    opcode = substr(inst,4,2)                  /* get the opcode     */ 00118617
    mod1   = substr(inst,3,1)                  /* mode 1st parm      */ 00118717
    mod2   = substr(inst,2,1)                  /* mode 2nd parm      */ 00118817
    mod3   = substr(inst,1,1)                  /* mode 3rd parm      */ 00118917
    select                                                              00119017
      when opcode = '01' then do               /* Addition           */ 00119117
        p1 =   next + 1                                                 00119217
        p2 =   next + 2                                                 00119317
        p3 =   next + 3                                                 00119417
        parm1 = p.p1                                                    00119517
        parm2 = p.p2                                                    00119617
        parm3 = p.p3                                                    00119717
        next = next + 4                                                 00119817
        if mod1 = 0 then parm1 = p.parm1                                00119917
        if mod2 = 0 then parm2 = p.parm2                                00120017
                                                                        00120117
                                                                        00120217
        p.parm3 = parm1 + parm2                                         00120317
        iterate                                                         00120417
      end                                                               00120517
      when opcode = '02' then do               /* Multiplication     */ 00120617
        p1 =   next + 1                                                 00120717
        p2 =   next + 2                                                 00120817
        p3 =   next + 3                                                 00120917
        parm1 = p.p1                                                    00121017
        parm2 = p.p2                                                    00121117
        parm3 = p.p3                                                    00121217
        next = next + 4                                                 00121317
        if mod1 = 0 then parm1 = p.parm1                                00121400
        if mod2 = 0 then parm2 = p.parm2                                00121500
                                                                        00121600
        p.parm3 = parm1 * parm2                                         00121700
        iterate                                                         00121800
      end                                                               00121900
      when opcode = '03' then do               /* Store              */ 00122000
        p1 =   next + 1                                                 00122100
        parm1 = p.p1                                                    00122200
        next = next + 2                                                 00122300
                                                                        00122400
        p.parm1 = theInput                                              00122500
        theInput = input2                                               00122623
        iterate                                                         00123000
      end                                                               00124000
      when opcode = '04' then do               /* Output             */ 00125000
        p1 = next + 1                                                   00125100
        parm1 = p.p1                                                    00125200
        if mod1 = 0 then parm1 = p.parm1                                00125300
        res = parm1                                                     00125513
        next = next + 2                                                 00125700
        iterate                                                         00125800
      end                                                               00125900
      when opcode = '05' then do               /* Jump if true       */ 00126037
        p1 = next + 1                                                   00126137
        p2 = next + 2                                                   00126237
        parm1 = p.p1                                                    00126337
        parm2 = p.p2                                                    00126437
        if mod1 = 0 then parm1 = p.parm1                                00126537
        if mod2 = 0 then parm2 = p.parm2                                00126637
        if parm1 /= 0 then next = parm2                                 00126737
                      else next = next + 3                              00126837
      end                                                               00126937
      when opcode = '06' then do               /* Jump if false      */ 00127037
        p1 = next + 1                                                   00127137
        p2 = next + 2                                                   00127237
        parm1 = p.p1                                                    00127337
        parm2 = p.p2                                                    00127437
        if mod1 = 0 then parm1 = p.parm1                                00127537
        if mod2 = 0 then parm2 = p.parm2                                00127637
        if parm1 = 0 then next = parm2                                  00127737
                     else next = next + 3                               00127837
      end                                                               00127937
      when opcode = '07' then do               /* Less than          */ 00128037
        p1 = next + 1                                                   00128137
        p2 = next + 2                                                   00128237
        p3 = next + 3                                                   00128337
        parm1 = p.p1                                                    00128437
        parm2 = p.p2                                                    00128537
        parm3 = p.p3                                                    00128637
        if mod1 = 0 then parm1 = p.parm1                                00128737
        if mod2 = 0 then parm2 = p.parm2                                00128837
        if parm1 < parm2 then p.parm3 = 1                               00128937
                         else p.parm3 = 0                               00129037
        next = next + 4                                                 00129137
      end                                                               00129237
      when opcode = '08' then do               /* Equals             */ 00129337
        p1 = next + 1                                                   00129437
        p2 = next + 2                                                   00129537
        p3 = next + 3                                                   00129637
        parm1 = p.p1                                                    00129737
        parm2 = p.p2                                                    00129837
        parm3 = p.p3                                                    00129937
        if mod1 = 0 then parm1 = p.parm1                                00130037
        if mod2 = 0 then parm2 = p.parm2                                00130137
        if parm1 = parm2 then p.parm3 = 1                               00130237
                         else p.parm3 = 0                               00130337
        next = next + 4                                                 00130437
      end                                                               00130537
      when opcode = '99' then do               /* Terminate          */ 00130600
        cont = 0                                                        00130700
      end                                                               00130800
      otherwise do                                                      00130900
        say "unexpected opcode ("opcode") at "next                      00131036
      end                                                               00131100
    end                                                                 00131200
    if next > instructions then cont = 0                                00131300
  end                                                                   00131400
  return res                                                            00132000
                                                                        00140000
