/* REXX */                                                              00010000
                                                                        00020000
p = ''                                                                  00030000
p = p || '3, 8, 1001, 8, 10, 8, 105, '                                  00040000
p = p || '1, 0, 0, 21, 38, 47, 72, '                                    00041000
p = p || '97, 122, 203, 284, 365, 446, 99999, '                         00042000
p = p || '3, 9, 1001, 9, 3, 9, 1002, '                                  00043000
p = p || '9, 5, 9, 1001, 9, 4, 9, '                                     00044000
p = p || '4, 9, 99, 3, 9, 102, 3, '                                     00045000
p = p || '9, 9, 4, 9, 99, 3, 9, '                                       00046000
p = p || '1001, 9, 2, 9, 102, 5, 9, '                                   00047000
p = p || '9, 101, 3, 9, 9, 1002, 9, '                                   00047100
p = p || '5, 9, 101, 4, 9, 9, 4, '                                      00047200
p = p || '9, 99, 3, 9, 101, 5, 9, '                                     00047300
p = p || '9, 1002, 9, 3, 9, 101, 2, '                                   00047400
p = p || '9, 9, 102, 3, 9, 9, 1001, '                                   00047500
p = p || '9, 2, 9, 4, 9, 99, 3, '                                       00047600
p = p || '9, 101, 3, 9, 9, 102, 2, '                                    00047700
p = p || '9, 9, 1001, 9, 4, 9, 1002, '                                  00047800
p = p || '9, 2, 9, 101, 2, 9, 9, '                                      00047900
p = p || '4, 9, 99, 3, 9, 1001, 9, '                                    00048000
p = p || '2, 9, 4, 9, 3, 9, 101, '                                      00048100
p = p || '2, 9, 9, 4, 9, 3, 9, '                                        00048200
p = p || '102, 2, 9, 9, 4, 9, 3, '                                      00048300
p = p || '9, 1001, 9, 1, 9, 4, 9, '                                     00048400
p = p || '3, 9, 102, 2, 9, 9, 4, '                                      00048500
p = p || '9, 3, 9, 101, 2, 9, 9, '                                      00048600
p = p || '4, 9, 3, 9, 1001, 9, 1, '                                     00048700
p = p || '9, 4, 9, 3, 9, 101, 2, '                                      00048800
p = p || '9, 9, 4, 9, 3, 9, 101, '                                      00048900
p = p || '1, 9, 9, 4, 9, 3, 9, '                                        00049000
p = p || '1001, 9, 2, 9, 4, 9, 99, '                                    00049100
p = p || '3, 9, 1001, 9, 1, 9, 4, '                                     00049200
p = p || '9, 3, 9, 101, 1, 9, 9, '                                      00049300
p = p || '4, 9, 3, 9, 101, 2, 9, '                                      00049400
p = p || '9, 4, 9, 3, 9, 102, 2, '                                      00049500
p = p || '9, 9, 4, 9, 3, 9, 101, '                                      00049600
p = p || '2, 9, 9, 4, 9, 3, 9, '                                        00049700
p = p || '101, 1, 9, 9, 4, 9, 3, '                                      00049800
p = p || '9, 1002, 9, 2, 9, 4, 9, '                                     00049900
p = p || '3, 9, 101, 1, 9, 9, 4, '                                      00050000
p = p || '9, 3, 9, 102, 2, 9, 9, '                                      00050100
p = p || '4, 9, 3, 9, 102, 2, 9, '                                      00050200
p = p || '9, 4, 9, 99, 3, 9, 1001, '                                    00050300
p = p || '9, 2, 9, 4, 9, 3, 9, '                                        00050400
p = p || '1002, 9, 2, 9, 4, 9, 3, '                                     00050500
p = p || '9, 1001, 9, 2, 9, 4, 9, '                                     00050600
p = p || '3, 9, 102, 2, 9, 9, 4, '                                      00050700
p = p || '9, 3, 9, 102, 2, 9, 9, '                                      00050800
p = p || '4, 9, 3, 9, 101, 2, 9, '                                      00050900
p = p || '9, 4, 9, 3, 9, 1001, 9, '                                     00051000
p = p || '1, 9, 4, 9, 3, 9, 101, '                                      00051100
p = p || '1, 9, 9, 4, 9, 3, 9, '                                        00051200
p = p || '1002, 9, 2, 9, 4, 9, 3, '                                     00051300
p = p || '9, 102, 2, 9, 9, 4, 9, '                                      00051400
p = p || '99, 3, 9, 101, 1, 9, 9, '                                     00051500
p = p || '4, 9, 3, 9, 101, 1, 9, '                                      00051600
p = p || '9, 4, 9, 3, 9, 102, 2, '                                      00051700
p = p || '9, 9, 4, 9, 3, 9, 102, '                                      00051800
p = p || '2, 9, 9, 4, 9, 3, 9, '                                        00051900
p = p || '101, 2, 9, 9, 4, 9, 3, '                                      00052000
p = p || '9, 101, 2, 9, 9, 4, 9, '                                      00052100
p = p || '3, 9, 1001, 9, 2, 9, 4, '                                     00052200
p = p || '9, 3, 9, 1001, 9, 2, 9, '                                     00052300
p = p || '4, 9, 3, 9, 102, 2, 9, '                                      00052400
p = p || '9, 4, 9, 3, 9, 1001, 9, '                                     00052500
p = p || '1, 9, 4, 9, 99, 3, 9, '                                       00052600
p = p || '101, 2, 9, 9, 4, 9, 3, '                                      00052700
p = p || '9, 101, 2, 9, 9, 4, 9, '                                      00052800
p = p || '3, 9, 1001, 9, 2, 9, 4, '                                     00052900
p = p || '9, 3, 9, 102, 2, 9, 9, '                                      00053000
p = p || '4, 9, 3, 9, 102, 2, 9, '                                      00053100
p = p || '9, 4, 9, 3, 9, 101, 1, '                                      00053200
p = p || '9, 9, 4, 9, 3, 9, 1002, '                                     00053300
p = p || '9, 2, 9, 4, 9, 3, 9, '                                        00053400
p = p || '1002, 9, 2, 9, 4, 9, 3, '                                     00053500
p = p || '9, 101, 2, 9, 9, 4, 9, '                                      00053600
p = p || '3, 9, 1001, 9, 2, 9, 4, '                                     00053700
p = p || '9, 99'                                                        00053800
                                                                        00053900
                                                                        00054000
tv.0 = 5                                                                00055000
tv.1 = 0                                                                00056000
tv.2 = 5                                                                00057000
tv.3 = 6                                                                00058000
tv.4 = 7                                                                00059000
tv.5 = 8                                                                00060000
                                                                        00070000
maxPower = 0                                                            00080000
powers=""                                                               00090000
do a = 1 to tv.0                                                        00100000
  do b = 1 to tv.0                                                      00110000
    if b /= a then do                                                   00111000
      do c = 1 to tv.0                                                  00112000
        if c /= a & c /=b then do                                       00112100
          do d = 1 to tv.0                                              00112200
            if d /= a & d /= b & c /= d then do                         00112300
              do e = 1 to tv.0                                          00112400
                if e /= a & e /= b & e /= c & e /= d then do            00112500
                  theInput = tv.a                                       00112600
                  input2 = 0                                            00112700
                  pa = run2(p)                                          00112800
                  theInput = tv.b                                       00112900
                  input2 = pa                                           00113000
                  pb = run2(p)                                          00113100
                  theInput = tv.c                                       00113200
                  input2 = pb                                           00113300
                  pc = run2(p)                                          00113400
                  theInput = tv.d                                       00113500
                  input2 = pc                                           00113600
                  pd = run2(p)                                          00113700
                  theInput = tv.e                                       00113800
                  input2 = pd                                           00113900
                  pe = run2(p)                                          00114000
                  totalPower = pe                                       00115000
                  powers = powers","pe                                  00115100
                  if totalPower > maxPower then do                      00115200
                    maxPower = totalPower                               00115300
                    maxConfig = tv.a tv.b tv.c tv.d tv.e                00115400
                  end                                                   00115500
                end                                                     00115600
              end                                                       00115700
            end                                                         00115800
          end                                                           00115900
        end                                                             00116000
      end                                                               00116100
    end                                                                 00116200
  end                                                                   00116300
end                                                                     00116400
say powers                                                              00116500
say maxPower                                                            00116600
say maxConfig                                                           00116700
                                                                        00116800
exit                                                                    00116900
                                                                        00117000
run2:                                                                   00117100
  parse arg prog                                                        00117200
  res = "NO OUTPUT"                                                     00117300
  prog = translate(prog, ' ', ',')             /* get rid of commas  */ 00117400
  instructions = words(prog)                   /* count them all     */ 00117500
  p. = ''                                      /* stick em in a stem */ 00117600
  do i = 0 to instructions                                              00117700
    p.i= word(prog, i+1)                                                00117800
  end                                                                   00117900
  next = 0                                     /* point to next inst */ 00118000
  cont = 1                                     /* no halt psw :)     */ 00118100
  do while cont = 1                                                     00118200
    inst = right(p.next,'5',0)                 /* get the full inst  */ 00118300
    opcode = substr(inst,4,2)                  /* get the opcode     */ 00118400
    mod1   = substr(inst,3,1)                  /* mode 1st parm      */ 00118500
    mod2   = substr(inst,2,1)                  /* mode 2nd parm      */ 00118600
    mod3   = substr(inst,1,1)                  /* mode 3rd parm      */ 00118700
    select                                                              00118800
      when opcode = '01' then do               /* Addition           */ 00118900
        p1 =   next + 1                                                 00119000
        p2 =   next + 2                                                 00119100
        p3 =   next + 3                                                 00119200
        parm1 = p.p1                                                    00119300
        parm2 = p.p2                                                    00119400
        parm3 = p.p3                                                    00119500
        next = next + 4                                                 00119600
        if mod1 = 0 then parm1 = p.parm1                                00119700
        if mod2 = 0 then parm2 = p.parm2                                00119800
                                                                        00119900
                                                                        00120000
        p.parm3 = parm1 + parm2                                         00120100
        iterate                                                         00120200
      end                                                               00120300
      when opcode = '02' then do               /* Multiplication     */ 00120400
        p1 =   next + 1                                                 00120500
        p2 =   next + 2                                                 00120600
        p3 =   next + 3                                                 00120700
        parm1 = p.p1                                                    00120800
        parm2 = p.p2                                                    00120900
        parm3 = p.p3                                                    00121000
        next = next + 4                                                 00121100
        if mod1 = 0 then parm1 = p.parm1                                00121200
        if mod2 = 0 then parm2 = p.parm2                                00121300
                                                                        00121400
        p.parm3 = parm1 * parm2                                         00121500
        iterate                                                         00121600
      end                                                               00121700
      when opcode = '03' then do               /* Store              */ 00121800
        p1 =   next + 1                                                 00121900
        parm1 = p.p1                                                    00122000
        next = next + 2                                                 00122100
                                                                        00122200
        p.parm1 = theInput                                              00122300
        theInput = input2                                               00122400
        iterate                                                         00122500
      end                                                               00122600
      when opcode = '04' then do               /* Output             */ 00122700
        p1 = next + 1                                                   00122800
        parm1 = p.p1                                                    00122900
        if mod1 = 0 then parm1 = p.parm1                                00123000
        res = parm1                                                     00124000
        next = next + 2                                                 00125000
        iterate                                                         00125100
      end                                                               00125200
      when opcode = '05' then do               /* Jump if true       */ 00125300
        p1 = next + 1                                                   00125400
        p2 = next + 2                                                   00125500
        parm1 = p.p1                                                    00125600
        parm2 = p.p2                                                    00125700
        if mod1 = 0 then parm1 = p.parm1                                00125800
        if mod2 = 0 then parm2 = p.parm2                                00125900
        if parm1 /= 0 then next = parm2                                 00126000
                      else next = next + 3                              00126100
      end                                                               00126200
      when opcode = '06' then do               /* Jump if false      */ 00126300
        p1 = next + 1                                                   00126400
        p2 = next + 2                                                   00126500
        parm1 = p.p1                                                    00126600
        parm2 = p.p2                                                    00126700
        if mod1 = 0 then parm1 = p.parm1                                00126800
        if mod2 = 0 then parm2 = p.parm2                                00126900
        if parm1 = 0 then next = parm2                                  00127000
                     else next = next + 3                               00127100
      end                                                               00127200
      when opcode = '07' then do               /* Less than          */ 00127300
        p1 = next + 1                                                   00127400
        p2 = next + 2                                                   00127500
        p3 = next + 3                                                   00127600
        parm1 = p.p1                                                    00127700
        parm2 = p.p2                                                    00127800
        parm3 = p.p3                                                    00127900
        if mod1 = 0 then parm1 = p.parm1                                00128000
        if mod2 = 0 then parm2 = p.parm2                                00128100
        if parm1 < parm2 then p.parm3 = 1                               00128200
                         else p.parm3 = 0                               00128300
        next = next + 4                                                 00128400
      end                                                               00128500
      when opcode = '08' then do               /* Equals             */ 00128600
        p1 = next + 1                                                   00128700
        p2 = next + 2                                                   00128800
        p3 = next + 3                                                   00128900
        parm1 = p.p1                                                    00129000
        parm2 = p.p2                                                    00129100
        parm3 = p.p3                                                    00129200
        if mod1 = 0 then parm1 = p.parm1                                00129300
        if mod2 = 0 then parm2 = p.parm2                                00129400
        if parm1 = parm2 then p.parm3 = 1                               00129500
                         else p.parm3 = 0                               00129600
        next = next + 4                                                 00129700
      end                                                               00129800
      when opcode = '99' then do               /* Terminate          */ 00129900
        cont = 0                                                        00130000
      end                                                               00130100
      otherwise do                                                      00130200
        say "unexpected opcode ("opcode") at "next                      00130300
      end                                                               00130400
    end                                                                 00130500
    if next > instructions then cont = 0                                00130600
  end                                                                   00130700
  return res                                                            00130800
                                                                        00130900
