/* REXX */                                                              00010000
                                                                        00020000
p = ''                                                                  00030000
p = p || '3, 8, 1001, 8, 10, 8, 105, '                                  00040000
p = p || '1, 0, 0, 21, 38, 47, 72, '                                    00041000
p = p || '97, 122, 203, 284, 365, 446, 99999, '                         00042000
p = p || '3, 9, 1001, 9, 3, 9, 1002, '                                  00043000
p = p || '9, 5, 9, 1001, 9, 4, 9, '                                     00044000
p = p || '4, 9, 99, 3, 9, 102, 3, '                                     00045000
p = p || '9, 9, 4, 9, 99, 3, 9, '                                       00046000
p = p || '1001, 9, 2, 9, 102, 5, 9, '                                   00047000
p = p || '9, 101, 3, 9, 9, 1002, 9, '                                   00047100
p = p || '5, 9, 101, 4, 9, 9, 4, '                                      00047200
p = p || '9, 99, 3, 9, 101, 5, 9, '                                     00047300
p = p || '9, 1002, 9, 3, 9, 101, 2, '                                   00047400
p = p || '9, 9, 102, 3, 9, 9, 1001, '                                   00047500
p = p || '9, 2, 9, 4, 9, 99, 3, '                                       00047600
p = p || '9, 101, 3, 9, 9, 102, 2, '                                    00047700
p = p || '9, 9, 1001, 9, 4, 9, 1002, '                                  00047800
p = p || '9, 2, 9, 101, 2, 9, 9, '                                      00047900
p = p || '4, 9, 99, 3, 9, 1001, 9, '                                    00048000
p = p || '2, 9, 4, 9, 3, 9, 101, '                                      00048100
p = p || '2, 9, 9, 4, 9, 3, 9, '                                        00048200
p = p || '102, 2, 9, 9, 4, 9, 3, '                                      00048300
p = p || '9, 1001, 9, 1, 9, 4, 9, '                                     00048400
p = p || '3, 9, 102, 2, 9, 9, 4, '                                      00048500
p = p || '9, 3, 9, 101, 2, 9, 9, '                                      00048600
p = p || '4, 9, 3, 9, 1001, 9, 1, '                                     00048700
p = p || '9, 4, 9, 3, 9, 101, 2, '                                      00048800
p = p || '9, 9, 4, 9, 3, 9, 101, '                                      00048900
p = p || '1, 9, 9, 4, 9, 3, 9, '                                        00049000
p = p || '1001, 9, 2, 9, 4, 9, 99, '                                    00049100
p = p || '3, 9, 1001, 9, 1, 9, 4, '                                     00049200
p = p || '9, 3, 9, 101, 1, 9, 9, '                                      00049300
p = p || '4, 9, 3, 9, 101, 2, 9, '                                      00049400
p = p || '9, 4, 9, 3, 9, 102, 2, '                                      00049500
p = p || '9, 9, 4, 9, 3, 9, 101, '                                      00049600
p = p || '2, 9, 9, 4, 9, 3, 9, '                                        00049700
p = p || '101, 1, 9, 9, 4, 9, 3, '                                      00049800
p = p || '9, 1002, 9, 2, 9, 4, 9, '                                     00049900
p = p || '3, 9, 101, 1, 9, 9, 4, '                                      00050000
p = p || '9, 3, 9, 102, 2, 9, 9, '                                      00050100
p = p || '4, 9, 3, 9, 102, 2, 9, '                                      00050200
p = p || '9, 4, 9, 99, 3, 9, 1001, '                                    00050300
p = p || '9, 2, 9, 4, 9, 3, 9, '                                        00050400
p = p || '1002, 9, 2, 9, 4, 9, 3, '                                     00050500
p = p || '9, 1001, 9, 2, 9, 4, 9, '                                     00050600
p = p || '3, 9, 102, 2, 9, 9, 4, '                                      00050700
p = p || '9, 3, 9, 102, 2, 9, 9, '                                      00050800
p = p || '4, 9, 3, 9, 101, 2, 9, '                                      00050900
p = p || '9, 4, 9, 3, 9, 1001, 9, '                                     00051000
p = p || '1, 9, 4, 9, 3, 9, 101, '                                      00051100
p = p || '1, 9, 9, 4, 9, 3, 9, '                                        00051200
p = p || '1002, 9, 2, 9, 4, 9, 3, '                                     00051300
p = p || '9, 102, 2, 9, 9, 4, 9, '                                      00051400
p = p || '99, 3, 9, 101, 1, 9, 9, '                                     00051500
p = p || '4, 9, 3, 9, 101, 1, 9, '                                      00051600
p = p || '9, 4, 9, 3, 9, 102, 2, '                                      00051700
p = p || '9, 9, 4, 9, 3, 9, 102, '                                      00051800
p = p || '2, 9, 9, 4, 9, 3, 9, '                                        00051900
p = p || '101, 2, 9, 9, 4, 9, 3, '                                      00052000
p = p || '9, 101, 2, 9, 9, 4, 9, '                                      00052100
p = p || '3, 9, 1001, 9, 2, 9, 4, '                                     00052200
p = p || '9, 3, 9, 1001, 9, 2, 9, '                                     00052300
p = p || '4, 9, 3, 9, 102, 2, 9, '                                      00052400
p = p || '9, 4, 9, 3, 9, 1001, 9, '                                     00052500
p = p || '1, 9, 4, 9, 99, 3, 9, '                                       00052600
p = p || '101, 2, 9, 9, 4, 9, 3, '                                      00052700
p = p || '9, 101, 2, 9, 9, 4, 9, '                                      00052800
p = p || '3, 9, 1001, 9, 2, 9, 4, '                                     00052900
p = p || '9, 3, 9, 102, 2, 9, 9, '                                      00053000
p = p || '4, 9, 3, 9, 102, 2, 9, '                                      00053100
p = p || '9, 4, 9, 3, 9, 101, 1, '                                      00053200
p = p || '9, 9, 4, 9, 3, 9, 1002, '                                     00053300
p = p || '9, 2, 9, 4, 9, 3, 9, '                                        00053400
p = p || '1002, 9, 2, 9, 4, 9, 3, '                                     00053500
p = p || '9, 101, 2, 9, 9, 4, 9, '                                      00053600
p = p || '3, 9, 1001, 9, 2, 9, 4, '                                     00053700
p = p || '9, 99'                                                        00053800
                                                                        00053900
/*                                                                      00054099
p = '3,26,1001,26,-4,26,3,27,1002,27,2,27,1,27,26,'                     00054199
p = p || '27,4,27,1001,28,-1,28,1005,28,6,99,0,0,5'                     00054299
                                                                        00054399
p='3,52,1001,52,-5,52,3,53,1,52,56,54,1007,54,5,55,1005,55,26,1001,54,' 00054499
p=p'-5,54,1105,1,12,1,53,54,53,1008,54,0,55,1001,55,1,55,2,53,55,53,4,' 00054599
p=p'53,1001,56,-1,56,1005,56,6,99,0,0,0,0,10'                           00054699
*/                                                                      00054799
                                                                        00055499
tv.0 = 5                                                                00055599
tv.1 = 5                                                                00056002
tv.2 = 6                                                                00057002
tv.3 = 7                                                                00058002
tv.4 = 8                                                                00059002
tv.5 = 9                                                                00060002
                                                                        00070000
                                                                        00070108
OMGINEEDDEBUG = 0                                                       00070899
                                                                        00070935
say "---------------_"                                                  00077013
maxPower = 0                                                            00080000
powers=""                                                               00090000
/* this ugly bit is just permutating the possible initial inputs */     00091099
do aa = 1 to tv.0                                                       00100099
  do bb = 1 to tv.0                                                     00110099
    if bb /= aa then do                                                 00111099
      do cc = 1 to tv.0                                                 00112099
        if cc /= aa & cc /=bb then do                                   00112299
          do dd = 1 to tv.0                                             00112399
            if dd /= aa & dd /= bb & dd /= cc then do                   00112599
              do ee = 1 to tv.0                                         00112699
                if ee /= aa & ee /= bb & ee /= cc & ee /= dd then do    00112899
                  vms. = 5                                              00113099
                  vms.1 = p                                             00113199
                  vms.2 = p                                             00113299
                  vms.3 = p                                             00113399
                  vms.4 = p                                             00113499
                  vms.5 = p                                             00113599
                  res.1 = null                                          00113699
                  res.2 = null                                          00113799
                  res.3 = null                                          00113899
                  res.4 = null                                          00113999
                  res.5 = null                                          00114099
                  in.1 = tv.aa                                          00114199
                  in.2 = tv.bb                                          00114299
                  in.3 = tv.cc                                          00114399
                  in.4 = tv.dd                                          00114499
                  in.5 = tv.ee                                          00114599
                  okvms = 0                                             00114699
                  firstrun = 1                                          00114799
                  do while okvms < 5                                    00114899
                    do vm = 1 to vms.0                                  00115099
                      h = debug("Running vm "vm" with input" in.vm)     00115199
                      /* run all vms */                                 00115299
                      r = run2(vms.vm, in.vm)                           00115399
                      if r = "DONE" then do                             00115599
                        h = debug("VM "vm" is done")                    00115699
                        okvms = okvms + 1                               00115799
                      end                                               00116999
                      else do                                           00117099
                        h = debug("VM "vm" is not done")                00117199
                        if pos('<',r) > 0 then do                       00117299
                          h = debug("VM "vm" needs input")              00117399
                          /* needs more input */                        00117499
                          if firstrun = 1 & vm = 1 then do              00117599
                            h = debug("Giving 1 the s")                 00117699
                            /* vm1 gets a 0 as extra input once */      00117799
                            in.vm = 0                                   00117899
                            /*                                          00117999
                            r = run2(vms.vm,0)                          00118099
                            firstrun = 0                                00118199
                            if pos('<',r) > 0 then do                   00118299
                              h = debug("Still needs input")            00118399
                              vms.vm = r                                00118499
                            end                                         00118599
                            if pos('>',r) > 0 then do                   00118699
                              h = debug("Produced output")              00118799
                              vms.vm = r                                00118899
                            end */                                      00119099
                                                                        00119299
                          end                                           00119399
                          vms.vm = r                                    00119499
                        end                                             00119599
                        if pos('>',r) > 0 then do                       00119699
                          /* vm produced output */                      00119799
                          parse var r n '>' v '=' rest                  00119899
                          d =debug("VM "vm" yielded output: "v)         00119999
                          vms.vm = r                                    00120099
                          if vm = 1 then do                             00120199
                            in.2 = v                                    00120299
                          end                                           00120399
                          if vm = 2 then do                             00120499
                            in.3 = v                                    00120599
                          end                                           00120699
                          if vm = 3 then do                             00120799
                            in.4 = v                                    00120899
                          end                                           00120999
                          if vm = 4 then do                             00121099
                            in.5 = v                                    00121199
                          end                                           00121299
                          if vm = 5 then do                             00121399
                            in.1 = v                                    00121499
                          end                                           00121599
                        end                                             00121699
                      end                                               00121799
                    end                                                 00121899
                    if okvms /= 5 then do                               00121999
                      vm = 1                                            00122099
                    end                                                 00122199
                    else do                                             00122299
                      h = debug("*********Should be done val = "in.1)   00122399
                      totalPower = in.1                                 00122499
                    end                                                 00122599
                  end                                                   00122699
               /* powers = powers","totalPower */                       00122799
                  if totalPower > maxPower then do                      00122899
                    maxPower = totalPower                               00122999
                    maxConfig = tv.aa tv.bb tv.cc tv.dd tv.ee           00123099
                  end                                                   00123199
                end                                                     00123299
              end                                                       00123399
            end                                                         00123499
          end                                                           00123599
        end                                                             00123699
      end                                                               00123799
    end                                                                 00123899
  end                                                                   00123999
end                                                                     00124099
say powers                                                              00124199
say maxPower                                                            00124299
say maxConfig                                                           00124399
                                                                        00124499
exit                                                                    00124599
                                                                        00124699
run2:                                                                   00124799
  parse arg prog,in1,in2                                                00124899
  res = "NO OUTPUT"                                                     00124999
  theInput = in1                                                        00125099
  next = 0                                                              00125199
  /* check for saved state */                                           00125299
  if pos('<',prog) > 0 then do                                          00125399
    next = substr(prog,1,pos('<',prog)-1)      /* read saved ins pos */ 00125499
    prog = substr(prog,pos('<',prog)+1)        /* for input wait     */ 00125599
  end                                                                   00125699
  if pos('>',prog) > 0 then do                                          00125799
    next = substr(prog,1,pos('>',prog)-1)      /* read saved ins pos */ 00125899
    prog = substr(prog,pos('=',prog)+1)        /* for output wait    */ 00125999
  end                                                                   00126099
  prog = translate(prog, ' ', ',')             /* get rid of commas  */ 00126199
  instructions = words(prog)                   /* count them all     */ 00126299
  p. = ''                                      /* stick em in a stem */ 00126399
  do i = 0 to instructions                                              00126499
    p.i= word(prog, i+1)                                                00126599
  end                                                                   00126699
  cont = 1                                     /* no halt psw :)     */ 00126799
  do while cont = 1                                                     00126899
    inst = right(p.next,'5',0)                 /* get the full inst  */ 00126999
    opcode = substr(inst,4,2)                  /* get the opcode     */ 00127099
    mod1   = substr(inst,3,1)                  /* mode 1st parm      */ 00127199
    mod2   = substr(inst,2,1)                  /* mode 2nd parm      */ 00127299
    mod3   = substr(inst,1,1)                  /* mode 3rd parm      */ 00127399
    select                                                              00127499
      when opcode = '01' then do               /* Addition           */ 00127599
        p1 =   next + 1                                                 00127699
        p2 =   next + 2                                                 00127799
        p3 =   next + 3                                                 00127899
        parm1 = p.p1                                                    00127999
        parm2 = p.p2                                                    00128099
        parm3 = p.p3                                                    00128199
        next = next + 4                                                 00128299
        if mod1 = 0 then parm1 = p.parm1                                00128399
        if mod2 = 0 then parm2 = p.parm2                                00128499
                                                                        00128599
                                                                        00128699
        p.parm3 = parm1 + parm2                                         00128799
        iterate                                                         00128899
      end                                                               00128999
      when opcode = '02' then do               /* Multiplication     */ 00129099
        p1 =   next + 1                                                 00129199
        p2 =   next + 2                                                 00129299
        p3 =   next + 3                                                 00129399
        parm1 = p.p1                                                    00129499
        parm2 = p.p2                                                    00129599
        parm3 = p.p3                                                    00129699
        next = next + 4                                                 00129799
        if mod1 = 0 then parm1 = p.parm1                                00129899
        if mod2 = 0 then parm2 = p.parm2                                00129999
                                                                        00130099
        p.parm3 = parm1 * parm2                                         00130199
        iterate                                                         00130299
      end                                                               00130399
      when opcode = '03' then do               /* Store              */ 00130499
        p1 =   next + 1                                                 00130599
        parm1 = p.p1                                                    00130699
        if theInput = null then do                                      00130799
            /* input needed, save state */                              00130899
            st    = next"<"                                             00130999
            do x = 0 to instructions                                    00131099
              st    = st    || p.x                                      00131199
              if x <  instructions then                                 00131299
                st   = st    || ","                                     00131399
            end                                                         00131499
            return st                                                   00131599
        end                                                             00131699
        p.parm1 = theInput                                              00131899
        theInput = null                                                 00131999
        next = next + 2                                                 00132099
        iterate                                                         00132199
      end                                                               00132299
      when opcode = '04' then do               /* Output             */ 00132399
        p1 = next + 1                                                   00132499
        parm1 = p.p1                                                    00132599
        if mod1 = 0 then parm1 = p.parm1                                00132699
        /* There might be more outputs, save state and output */        00132799
        next = next + 2                                                 00132899
        st    = next">"parm1"="                                         00132999
        do x = 0 to instructions                                        00133099
          st    = st    || p.x                                          00133199
          if x <  instructions then                                     00133299
            st   = st    || ","                                         00133399
        end                                                             00133499
        return st                                                       00133599
        iterate                                                         00133699
      end                                                               00133799
      when opcode = '05' then do               /* Jump if true       */ 00133899
        p1 = next + 1                                                   00133999
        p2 = next + 2                                                   00134099
        parm1 = p.p1                                                    00134199
        parm2 = p.p2                                                    00134299
        if mod1 = 0 then parm1 = p.parm1                                00134399
        if mod2 = 0 then parm2 = p.parm2                                00134499
        if parm1 /= 0 then next = parm2                                 00134599
                      else next = next + 3                              00134699
      end                                                               00134799
      when opcode = '06' then do               /* Jump if false      */ 00134899
        p1 = next + 1                                                   00134999
        p2 = next + 2                                                   00135099
        parm1 = p.p1                                                    00135199
        parm2 = p.p2                                                    00135299
        if mod1 = 0 then parm1 = p.parm1                                00135399
        if mod2 = 0 then parm2 = p.parm2                                00135499
        if parm1 = 0 then next = parm2                                  00135599
                     else next = next + 3                               00135699
      end                                                               00135799
      when opcode = '07' then do               /* Less than          */ 00135899
        p1 = next + 1                                                   00135999
        p2 = next + 2                                                   00136099
        p3 = next + 3                                                   00136199
        parm1 = p.p1                                                    00136299
        parm2 = p.p2                                                    00136399
        parm3 = p.p3                                                    00136499
        if mod1 = 0 then parm1 = p.parm1                                00136599
        if mod2 = 0 then parm2 = p.parm2                                00136699
        if parm1 < parm2 then p.parm3 = 1                               00136799
                         else p.parm3 = 0                               00136899
        next = next + 4                                                 00136999
      end                                                               00137099
      when opcode = '08' then do               /* Equals             */ 00137199
        p1 = next + 1                                                   00137299
        p2 = next + 2                                                   00137399
        p3 = next + 3                                                   00137499
        parm1 = p.p1                                                    00137599
        parm2 = p.p2                                                    00137699
        parm3 = p.p3                                                    00137799
        if mod1 = 0 then parm1 = p.parm1                                00137899
        if mod2 = 0 then parm2 = p.parm2                                00137999
        if parm1 = parm2 then p.parm3 = 1                               00138099
                         else p.parm3 = 0                               00138199
        next = next + 4                                                 00138299
      end                                                               00138399
      when opcode = '99' then do               /* Terminate          */ 00138499
        cont = 0                                                        00138599
      end                                                               00138699
      otherwise do                                                      00138799
        say "unexpected opcode ("opcode") at "next                      00138899
      end                                                               00138999
    end                                                                 00139099
    if next > instructions then cont = 0                                00139199
  end                                                                   00139299
  return "DONE"                                                         00139399
                                                                        00139499
                                                                        00139501
debug:                                                                  00140099
  parse arg msg                                                         00150099
  if OMGINEEDDEBUG=1 then say msg                                       00151099
  return 0                                                              00170099
