/* REXX */                                                              00010000
                                                                        00020000
say "Testing"                                                           00030001
prog = "1,9,10,3,2,3,11,0,99,30,40,50"                                  00040001
r = run(prog)                                                           00050001
say prog "=>" r                                                         00060020
prog = "1,0,0,0,99"                                                     00061021
r = run(prog)                                                           00062021
say prog "=>" r                                                         00063021
prog = "2,3,0,3,99"                                                     00064025
r = run(prog)                                                           00065025
say prog "=>" r                                                         00066025
prog = "2,4,4,5,99,0"                                                   00067040
r = run(prog)                                                           00068040
say prog "=>" r                                                         00069040
prog = "1,1,1,4,99,5,6,0,99"                                            00069141
r = run(prog)                                                           00069241
say prog "=>" r                                                         00069341
                                                                        00069442
say "Task 1 naive"                                                      00069543
                                                                        00069744
a  ="1,0,0,3,1,1,2,3,1,3,4,3,1,5,0,3,2,10,1,19,1,6,19,23,1,23,13,27,"   00069844
a =a"2,6,27,31,1,5,31,35,2,10,35,39,1,6,39,43,1,13,43,47,2,47,6,51,"    00069944
a =a"1,51,5,55,1,55,6,59,2,59,10,63,1,63,6,67,2,67,10,71,1,71,9,75,"    00070044
a =a"2,75,10,79,1,79,5,83,2,10,83,87,1,87,6,91,2,9,91,95,1,95,5,99,"    00070144
a =a"1,5,99,103,1,103,10,107,1,9,107,111,1,6,111,115,1,115,5,119,1,"    00070244
a =a"10,119,123,2,6,123,127,2,127,6,131,1,131,2,135,1,10,135,0,99,"     00070344
a =a"2,0,14,0"                                                          00070444
                                                                        00070544
r = run(a   )                                                           00070644
say a    "=>" r                                                         00070744
                                                                        00070842
                                                                        00071001
say "Task 1 changed"                                                    00072043
a  ="1,12,2,3,1,1,2,3,1,3,4,3,1,5,0,3,2,10,1,19,1,6,19,23,1,23,13,27,"  00073044
a =a"2,6,27,31,1,5,31,35,2,10,35,39,1,6,39,43,1,13,43,47,2,47,6,51,"    00074044
a =a"1,51,5,55,1,55,6,59,2,59,10,63,1,63,6,67,2,67,10,71,1,71,9,75,"    00075044
a =a"2,75,10,79,1,79,5,83,2,10,83,87,1,87,6,91,2,9,91,95,1,95,5,99,"    00076044
a =a"1,5,99,103,1,103,10,107,1,9,107,111,1,6,111,115,1,115,5,119,1,"    00077044
a =a"10,119,123,2,6,123,127,2,127,6,131,1,131,2,135,1,10,135,0,99,"     00078044
a =a"2,0,14,0"                                                          00079044
                                                                        00079144
r = run(a   )                                                           00079244
say a    "=>" r                                                         00079344
b = translate(r, ' ',',')                                               00079449
say "Solution: " word(b,1)                                              00079549
                                                                        00079643
                                                                        00079745
say "part two... pretty nasty lol"                                      00079845
v = 0                                                                   00079945
do while v < 100                                                        00080145
  n = 0                                                                 00080247
  do while n < 100                                                      00080345
    a  = "1,"n","v","                                                   00080447
    a =a"3,1,1,2,3,1,3,4,3,1,5,0,3,2,10,1,19,1,6,19,23,1,23,13,27,"     00080547
    a =a"2,6,27,31,1,5,31,35,2,10,35,39,1,6,39,43,1,13,43,47,2,47,6,51,"00080647
    a =a"1,51,5,55,1,55,6,59,2,59,10,63,1,63,6,67,2,67,10,71,1,71,9,75,"00080747
    a =a"2,75,10,79,1,79,5,83,2,10,83,87,1,87,6,91,2,9,91,95,1,95,5,99,"00080847
    a =a"1,5,99,103,1,103,10,107,1,9,107,111,1,6,111,115,1,115,5,119,1,"00080947
    a =a"10,119,123,2,6,123,127,2,127,6,131,1,131,2,135,1,10,135,0,99," 00081047
    a =a"2,0,14,0"                                                      00081147
    r = run(a   )                                                       00081245
    q = translate(r,' ',',')                                            00081346
    if word(q,1) = "19690720" then do                                   00081446
      say "I've got it"                                                 00081546
      say r                                                             00081646
      say "The answer is:" 100 * n + v                                  00081748
      exit                                                              00081846
    end                                                                 00081946
    n = n + 1                                                           00082047
  end                                                                   00082145
  v = v + 1                                                             00082247
end                                                                     00082345
                                                                        00082443
exit                                                                    00083001
                                                                        00090001
run:                                                                    00100001
  parse arg prog                                                        00110001
  /* prog is sets of 4 ints */                                          00120001
  prog = translate(prog,' ',',')                                        00130003
  instructions = words(prog)                                            00140004
  p. = ''                                                               00150004
  do i = 1 to instructions                                              00160004
    p.i = word(prog, i)                                                 00161004
  end                                                                   00170004
  p.0 = instructions                                                    00180004
  do jj = 1 to p.0 by 4                                                 00190005
    if jj + 4 <= p.0 then do                                            00200011
        verb = jj + 1                                                   00200205
        noun = jj + 2                                                   00200305
        res  = jj + 3                                                   00200432
        rp = p.res + 1                                                  00200523
        vp = p.verb + 1                                                 00200623
        np = p.noun + 1                                                 00200723
      if p.jj = "1" then do                                             00201005
        p.rp = p.np + p.vp                                              00201539
        iterate                                                         00201736
      end                                                               00201805
      if p.jj = "2" then do                                             00201910
        p.rp = p.vp * p.np                                              00202008
        iterate                                                         00202136
      end                                                               00202205
      if p.jj = "99" then do                                            00202305
        leave                                                           00202405
      end                                                               00202505
    end                                                                 00203005
  end                                                                   00210004
  r = p.1                                                               00211009
  do k = 2 to instructions                                              00220009
    r = r','p.k                                                         00221005
  end                                                                   00230005
  return r                                                              00240005
