/* REXX */

ADDRESS TSO
"ALLOC F(INFILE) DSN('IBMUSER.SOME$.FILE') SHR REU"
"EXECIO * DISKR INFILE ( FINIS STEM MYSTEM."
"FREE F(INFILE)"
do i = 1 to MYSTEM.0
  say MYSTEM.i
end
say "again"
"ALLOC F(INFILE) DSN('IBMUSER.SOME$.FILE') SHR REU"
"EXECIO * DISKR INFILE ( FINIS STEM MYSTEM."
"FREE F(INFILE)"
do i = 1 to MYSTEM.0
  say MYSTEM.i
end
